Core/src/Catalogs/ВнеоборотныеАктивы/ВнеоборотныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнеоборотныеАктивы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизацииРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнеоборотныеАктивы</name>
    <type>
      <types>CatalogRef.ТипОсновныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyОтветственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpАмортизационнаяГруппа</name>
    <type>
      <types>CatalogRef.AzRytmpОПТИМУС_АмортизационныеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/AccumulationRegisters/ВнеоборотныеАктивы/ВнеоборотныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВнеоборотныеАктивы</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Catalogs/ВнеоборотныеАктивы/Forms/ФормаРедактированияСчетовУчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	//СчетУчета = Параметры.СчетУчета;
	//СчетАмортизации = Параметры.СчетАмортизации;
	////+++	
	СчетУчетаРегл = Параметры.СчетУчетаРегл;
	СчетАмортизацииРегл = Параметры.СчетАмортизацииРегл;
	//---
	Если ОтказИзменитьСчетУчета(Ссылка) Тогда
		Элементы.ГруппаСчетовУчета.Подсказка = НСтр("ka='ბაზაში არის ამ გრძელვადიანი აქტივის თაობაზე მოძრაობები! აღრიცხვის ანგარიშების შეცვლა აკრძალულია!';ru='В базе есть движения по этому внеоборотному активу! Изменение счетов учета запрещено!';en='At the base there is movement on the non-current assets! Change of accounting is prohibited!'");
		Элементы.ГруппаСчетовУчета.Доступность = Ложь;
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	РегламентированныйУчетСервер.УстановитьВидимостьУпрУчета(ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчета) Тогда
	//	СчетУчета = ПредопределенноеЗначение("ПланСчетов.Управленческий.ВнеоборотныеАктивы");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетАмортизацииПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетАмортизации) Тогда
	//	СчетАмортизации = ПредопределенноеЗначение("ПланСчетов.Управленческий.АмортизацияВнеоборотныхАктивов");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	СчетУчета = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетАмортизации = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	
	//+++
	СчетУчетаРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	СчетАмортизацииРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	//---
	
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры // ПоУмолчанию()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет возможность изменения счета учета.
//
&НаСервере
Функция ОтказИзменитьСчетУчета(ТекстСообщения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнеоборотныеАктивы.Период,
	|	ВнеоборотныеАктивы.Регистратор,
	|	ВнеоборотныеАктивы.НомерСтроки,
	|	ВнеоборотныеАктивы.Активность,
	|	ВнеоборотныеАктивы.ВидДвижения,
	|	ВнеоборотныеАктивы.Организация,
	|	ВнеоборотныеАктивы.ВнеоборотныйАктив,
	|	ВнеоборотныеАктивы.Стоимость,
	|	ВнеоборотныеАктивы.Амортизация,
	|	ВнеоборотныеАктивы.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|ГДЕ
	|	ВнеоборотныеАктивы.ВнеоборотныйАктив = &ВнеоборотныйАктив");
	
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // ОтказИзменитьСчетУчета()

&НаКлиенте
Процедура ОповеститьОбИзмененииСчетовРасчетов()
	
	СтруктураПараметры = Новый Структура("СчетУчета, СчетАмортизации, СчетУчетаРегл, СчетАмортизацииРегл", СчетУчета, СчетАмортизации, СчетУчетаРегл, СчетАмортизацииРегл);
	Оповестить("ИзменилисьСчетаВнеоборотныеАктивы", СтруктураПараметры);
	
КонецПроцедуры

//+++
&НаКлиенте
Процедура СчетУчетаРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаРегл) Тогда
		СчетУчетаРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаРегл, СчетУчета);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетАмортизацииРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетАмортизацииРегл) Тогда
		СчетАмортизацииРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетАмортизацииРегл, СчетАмортизации);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры
//---

#КонецОбласти
